# Core CLI tools
brew "git"
brew "gh"                    # GitHub CLI (replaces hub)
brew "neovim"
brew "tmux"
brew "zsh"

# Search tools
brew "ripgrep"               # Fast grep (rg)
brew "fd"                    # Fast find
brew "fzf"                   # Fuzzy finder

# Development
brew "chruby"                # Ruby version manager
brew "ruby-install"          # Install rubies for chruby
brew "node"
brew "postgresql@16"

# Prompt
brew "starship"              # Cross-shell prompt

# Navigation
brew "zoxide"                # Smarter cd command

# Utilities
brew "jq"                    # JSON processor
brew "tree"                  # Directory tree
brew "htop"                  # Process viewer
brew "reattach-to-user-namespace"  # tmux clipboard fix

# Fonts (for terminal and neovim icons)
cask "font-jetbrains-mono-nerd-font"
